import BookListening from "./book-listening";
import BookReading from "./book-reading";

import { IUserbook } from "@/types";

interface IMyReadingProps {
  book: IUserbook;
}

const MyReading = ({ book }: IMyReadingProps) => {
  const { title, author } = book;

  return (
    <section className="lg:w-full lg:h-full">
      <div className="bg-foreground py-10 px-5 mt-2.5 lg:mt-0 rounded-[30px] md:px-10 md:pb-[25px] lg:pb-[53px]">
        <h3 className="text-primary text-xl font-bold mb-10 md:text-[28px] md:mb-8 lg:mb-[44px]">
          My library
        </h3>
        <BookReading book={book} />

        <div className="flex flex-col items-center justify-center">
          <h4 className="text-primary text-sm font-bold mb-[5px] md:text-xl">
            {title}
          </h4>
          <p className="text-[10px] text-[#686868] mb-5 md:text-sm md:mb-4 lg:pb-[25px]">
            {author}
          </p>

          <BookListening text="Серед представників націй світу, українці, можливо, мають таке ж право хвалитися своєю роллю в зміні світу, як і шотландці та інші національності, щодо яких написано книги, стверджуючи їхню претензію на формування ходу світової історії. У грудні 1991 року, коли громадяни України масово йшли на вибори, щоб висловити свою підтримку незалежності, вони також викинули могутній Радянський Союз на смітник історії. Події в Україні того часу мали великі міжнародні наслідки і дійсно змінили хід історії: Союз Радянський був розпущений тиждень після українського референдуму, а президент Джордж Г. В. Буш оголосив остаточну перемогу Заходу в тривалій і виснажливій Холодній війні. Світ наступний раз побачив Україну на телевізійних екранах у листопаді 2004 року, коли святково вдягнені в помаранчеві костюми толпи наповнили площі та вулиці Києва, вимагаючи справедливих виборів і досягаючи свого. Помаранчева революція надала загальну назву численним «колірним революціям», які поколихували авторитарні режими від Сербії до Лівану і від Грузії до Киргизії. Колірні революції не змінили пострадянського світу, але залишили тривалий слід і сподівання, що він якось зміниться. Українці знову з'явилися на телевізійних екранах світу в листопаді і грудні 2013 року, коли вони вирушили на вулиці Києва, цього разу на підтримку ближчих відносин з Європейським Союзом. У той момент, коли ентузіазм до Європейського Союзу був на низькому рівні серед його членів, готовність українців маршрутувати і залишатися на вулицях за низьких температур протягом днів, тижнів і місяців вражала та надихала громадян західної та центральної Європи." />
        </div>
      </div>
    </section>
  );
};

export default MyReading;
